Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
# importing the relevant libraries that are going to be needed during this notebook: 
# also really never assume this bit is going to get pasted for you!

import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

'wget' is not recognized as an internal or external command,
operable program or batch file.

In [4]:
urllib.request.urlretrieve(https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz, instacart_online_grocery_shopping_2017_05_01.tar.gz)

SyntaxError: invalid syntax (<ipython-input-4-33d8e6eb39db>, line 1)

In [ ]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

In [10]:
%cd instacart_2017_05_01

C:\Users\Kush Rawal\Documents\instacart_2017_05_01

In [11]:
!ls -lh *.csv

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [12]:
#this is pre-assignment becuase the above code simply directs us to the directory containing the above csv's. 
#without even looking I'n gonna take a fat stab at the notion were going to need these in pandas dataframes. 

#I'm executing the following code all in the following cell --> that I'll then squelch with ;
aisles = pd.read_csv('aisles.csv', header=0, engine='python')
print(aisles.shape)

(134, 2)

In [13]:
aisles.head(3)

   aisle_id                  aisle
0         1  prepared soups salads
1         2      specialty cheeses
2         3    energy granola bars

In [14]:
departments = pd.read_csv('departments.csv', header=0, engine='python')
print(departments.shape)

(21, 2)

In [15]:
departments.head(3)

   department_id department
0              1     frozen
1              2      other
2              3     bakery

In [16]:
order_prod_prior = pd.read_csv('order_products__prior.csv', header=0, engine='python')

In [17]:
order_prod_prior.head(3)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0

In [18]:
order_prod_train = pd.read_csv('order_products__train.csv', header=0, engine='python')
print(order_prod_train.shape)

(1384617, 4)

In [19]:
order_prod_train.head(3)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0

In [20]:
orders = pd.read_csv('orders.csv', header=0, engine='python')

In [21]:
orders.head(3)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0

In [22]:
products = pd.read_csv('products.csv', header=0, engine='python')
print(products.shape)

(49688, 4)

In [23]:
products.head(3)

   product_id                          product_name  aisle_id  department_id
0           1            Chocolate Sandwich Cookies        61             19
1           2                      All-Seasons Salt       104             13
2           3  Robust Golden Unsweetened Oolong Tea        94              7

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [24]:
##### YOUR CODE HERE #####

new_df = pd.concat([products["product_name"],products["product_id"]], axis=1)
ord_df = pd.concat([order_prod_prior["product_id"], order_prod_prior["add_to_cart_order"]],axis=1)

new_df.head(3)

                           product_name  product_id
0            Chocolate Sandwich Cookies           1
1                      All-Seasons Salt           2
2  Robust Golden Unsweetened Oolong Tea           3

In [25]:
ord_df.head(3)

   product_id  add_to_cart_order
0       33120                  1
1       28985                  2
2        9327                  3

In [26]:
merge_1_df = pd.merge(new_df, ord_df, on='product_id', how='inner')

In [27]:
merge_1_df.head(10)

                 product_name  product_id  add_to_cart_order
0  Chocolate Sandwich Cookies           1                  7
1  Chocolate Sandwich Cookies           1                  3
2  Chocolate Sandwich Cookies           1                  4
3  Chocolate Sandwich Cookies           1                  2
4  Chocolate Sandwich Cookies           1                 30
5  Chocolate Sandwich Cookies           1                  5
6  Chocolate Sandwich Cookies           1                  1
7  Chocolate Sandwich Cookies           1                  4
8  Chocolate Sandwich Cookies           1                  3
9  Chocolate Sandwich Cookies           1                  4

In [28]:
merge_1_df = pd.DataFrame(merge_1_df).copy()
merge_1_df['product_name'].value_counts(dropna=False).head(10)

Banana                    472565
Bag of Organic Bananas    379450
Organic Strawberries      264683
Organic Baby Spinach      241921
Organic Hass Avocado      213584
Organic Avocado           176815
Large Lemon               152657
Strawberries              142951
Limes                     140627
Organic Whole Milk        137905
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [29]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [39]:
# tidying the table 1 

tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy1.head()

D:\Anaconda\envs\unit2\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   index    variable  value
0    NaN  treatmenta    NaN
1    NaN  treatmenta   16.0
2    NaN  treatmenta    3.0
3    NaN  treatmentb    2.0
4    NaN  treatmentb   11.0

In [42]:
# renaming columns to something more reasonable.

tidy1 = tidy1.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy1

   name         trt  result
0   NaN  treatmenta     NaN
1   NaN  treatmenta    16.0
2   NaN  treatmenta     3.0
3   NaN  treatmentb     2.0
4   NaN  treatmentb    11.0
5   NaN  treatmentb     1.0

In [43]:
# droping the treatment part of the variable. 
tidy1.trt = tidy1.trt.str.replace('treatment', '')

tidy1

   name trt  result
0   NaN   a     NaN
1   NaN   a    16.0
2   NaN   a     3.0
3   NaN   b     2.0
4   NaN   b    11.0
5   NaN   b     1.0

In [48]:
# index = the unique identifier 
# columns = what the differentiator in the columns in the final wide format
# values = where the numbers are supposed to go -- in the middle column of the wide dataset

wide = tidy1.pivot_table(index='name', columns='trt', values='result')

wide

Empty DataFrame
Columns: []
Index: []

In [30]:
# table2 -> tidy

In [31]:
# tidy -> table2

In [32]:
flights = sns.load_dataset('flights')

In [50]:
# Flights Pivot Table

flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [53]:
flights_pivot = flights.pivot_table(flights, index='month', columns='year')

flights_pivot.head()

         passengers
year           1949 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 1960
month
January         112  115  145  171  196  204  242  284  315  340  360  417
February        118  126  150  180  196  188  233  277  301  318  342  391
March           132  141  178  193  236  235  267  317  356  362  406  419
April           129  135  163  181  235  227  269  313  348  348  396  461
May             121  125  172  183  229  234  270  318  355  363  420  472

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [34]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [35]:
##### YOUR CODE HERE #####